<a href="https://colab.research.google.com/github/Yeeun411/databaseClass/blob/main/%E2%80%8D%EA%B0%95%EC%98%88%EC%9D%80%5B%EC%9E%AC%ED%95%99_%EC%BB%B4%ED%93%A8%ED%84%B0_%EC%A0%84%EC%9E%90%EC%8B%9C%EC%8A%A4%ED%85%9C%EA%B3%B5%ED%95%99%EC%A0%84%EA%B3%B5%5D_ch6_homework_2023_dbc_student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - SQL2

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

To edit this cell, double click here
```
이름: 강예은
학번: 202000178
학과: 컴퓨터전자시스템공학부
제출일: 2023.11.30
```

- 권고사항: 모든 SQL select 문에 tuple variable를 사용할 것.

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 각 10점, 19번 20점, 총200점**

In [47]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [48]:
!pip install mysqlclient

Requirement already satisfied: mysqlclient in /usr/local/lib/python3.10/dist-packages (2.2.0)

### Use your host, id, password, and database

In [49]:
import getpass
user = 's202000178'
password = getpass.getpass()
host='dm.hufs.ac.kr'
database = 's202000178db'
connection_string = f'mysql://{user}:{password}@{host}:3306/{database}'

%sql $connection_string

··········

## Warning: Your companydb state MUST be clean as initial state

- Refer to jupyter notebook on "SQL Lab"

### When you list the name of employees, the name must be the following format:

- Output Schema and tuple format:

```
+------------------+
| Employee name    |
+------------------+
| John B. Smith    |
...
+------------------+
```

- Use MySQL concat 함수 사용, Refer to MySQL manual or  Googling

### 1-14번에 대해 SQL select 문을 작성하고 MySQL에서 실행한 결과물을 제출하시오.

#### 1. Retrieve the names of employees in department 5 who work more than 10 hours per week on the 'ProductX' project. (single SELECT 사용, MySQL concat 함수 사용)

In [5]:
%%sql
SELECT CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Employee_name
FROM EMPLOYEE e, PROJECT p, WORKS_ON w
WHERE e.ssn = w.essn
AND p.pnumber = w.pno
AND e.dno = 5
AND w.hours > 10
AND p.pname = 'ProductX';

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
2 rows affected.

[('John B. Smith',), ('Joyce A. English',)]


#### 2.  List the names of employees who have a dependent with the same sex as themselves. (EXISTS 사용)

In [18]:
%%sql
SELECT CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Employee_name
FROM EMPLOYEE e
WHERE EXISTS (
    SELECT *
    FROM DEPENDENT d
    WHERE e.ssn = d.essn AND e.sex = d.sex
);

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
2 rows affected.

[('John B. Smith',), ('Franklin T. Wong',)]

#### 3.  Find the names of employees that are directly supervised by 'Franklin Wong'. (EXISTS 사용)

In [7]:
%%sql
SELECT CONCAT(e1.fname, " ",e1.minit,". " ,e1.lname) AS Employee_name
FROM EMPLOYEE e1
WHERE EXISTS (
    SELECT *
    FROM EMPLOYEE e2
    WHERE e1.superssn = e2.ssn
    AND e2.fname = 'Franklin'
    AND e2.lname = 'Wong'
);

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
3 rows affected.

[('John B. Smith',), ('Joyce A. English',), ('Ramesh K. Narayan',)]

#### 4.  For each project, list the project name and the total hours per week (by all employees) spent on that project.
Output Schema:
```
+-----------------+-------------+
| Project name    | Total hours |
+-----------------+-------------+
```

In [8]:
%%sql
SELECT p.pname AS Project_name, SUM(w.hours) AS Total_hours
FROM PROJECT p, WORKS_ON w
WHERE p.pnumber = w.pno
GROUP BY p.pname;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
6 rows affected.

[('Computerization', Decimal('55.0')),
 ('Newbenefits', Decimal('55.0')),
 ('ProductX', Decimal('52.5')),
 ('ProductY', Decimal('37.5')),
 ('ProductZ', Decimal('50.0')),
 ('Reorganization', Decimal('25.0'))]

#### 5.  Retrieve the names of employees who work on every project managed by 'Administration' department.

In [9]:
%%sql

SELECT CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Employee_name
FROM EMPLOYEE e
WHERE NOT EXISTS (
    SELECT p.pnumber
    FROM PROJECT p
    WHERE p.dnum = (
        SELECT d.dnumber
        FROM DEPARTMENT d
        WHERE d.dname = 'Administration'
    )
    AND NOT EXISTS (
        SELECT w.pno
        FROM WORKS_ON w
        WHERE w.pno = p.pnumber
        AND w.essn = e.ssn
    )
);

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
2 rows affected.

[('Ahmad V. Jabbar',), ('Alicia J. Zelaya',)]

#### 6.  Retrieve the names of employees who do not work on any project which is located in 'Houston'. (NOT EXISTS 사용)

In [10]:
%%sql

SELECT CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Employee_name
FROM EMPLOYEE e
WHERE NOT EXISTS (
    SELECT *
    FROM WORKS_ON w, PROJECT p
    WHERE w.pno = p.pnumber
    AND e.ssn = w.essn
    AND p.plocation = 'Houston'
);

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
4 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 7.  For each department, retrieve the department name, and the average salary of employees working in that department.(소수점 이하 2자리까지만(버림) 출력, Refer to MySQL manual or  Googling)

Output schema
```
+-----------------+----------------+
| Department name | Average salary |
+-----------------+----------------+
```

In [16]:
%%sql

SELECT d.dname AS Department_name, TRUNCATE(AVG(e.salary), 2) AS Average_salary
FROM DEPARTMENT d, EMPLOYEE e
WHERE d.dnumber = e.dno
GROUP BY d.dname;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
3 rows affected.

[('Administration', Decimal('31000.00')),
 ('Headquarters', Decimal('55000.00')),
 ('Research', Decimal('33250.00'))]

#### 8.  Retrieve the average salary of all female employees. (소수점 이하 2자리까지만(버림) 출력, Refer to MySQL manual or  Googling)
Output Schema:
```
+----------------+
| Average salary |
+----------------+
```

In [17]:
%%sql

SELECT TRUNCATE(AVG(e.salary), 2) AS Average_salary
FROM EMPLOYEE e
WHERE e.sex = 'F';

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
1 rows affected.

[(Decimal('31000.00'),)]

#### 9.  Find the names and addresses of employees who work on at least one project located in Houston but whose department has no location in Houston. (EXISTS, NOT EXISTS 사용)

Output schema:

```
+---------------------+-------------------------+
| Employee name       | Address                 |
+---------------------+-------------------------+
```

In [27]:
%%sql

SELECT CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Employee_name, e.address AS Address
FROM EMPLOYEE e
WHERE EXISTS (
    SELECT *
    FROM WORKS_ON w, PROJECT p
    WHERE w.pno = p.pnumber
    AND w.essn = e.ssn
    AND p.plocation = 'Houston'
)
AND NOT EXISTS (
    SELECT *
    FROM DEPT_LOCATIONS dl
    WHERE dl.dnumber = e.dno
    AND dl.dlocation = 'Houston'
);

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
1 rows affected.

[('Jennifer S. Wallace', '291-Berry-Bellaire-TX')]

#### 10.  List the names of department managers who have no dependents. (EXISTS, NOT EXISTS 사용)

In [26]:
%%sql

SELECT CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Employee_name
FROM EMPLOYEE e
WHERE EXISTS (
    SELECT *
    FROM DEPARTMENT d
    WHERE d.mgrssn = e.ssn
)
AND NOT EXISTS (
    SELECT *
    FROM DEPENDENT dep
    WHERE dep.essn = e.ssn
);

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
1 rows affected.

[('James E. Borg',)]

#### 11. Retrieve the names of all employees who work in the department that has the employee with the highest salary among all employees.

In [40]:
%%sql

SELECT CONCAT(e2.fname, " ",e2.minit,". " ,e2.lname) AS Employee_name
FROM EMPLOYEE e1, EMPLOYEE e2
WHERE e1.dno = e2.dno
AND e1.salary = (
  SELECT MAX(salary)
  FROM EMPLOYEE);

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
1 rows affected.

[('James E. Borg',)]

#### 12. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (EXISTS 안에 EXISTS 사용)

In [36]:
%%sql

SELECT CONCAT(e1.fname, " ",e1.minit,". " ,e1.lname) AS Employee_name
FROM EMPLOYEE e1
WHERE EXISTS (
    SELECT *
    FROM EMPLOYEE e2
    WHERE e2.ssn = e1.superssn
    AND EXISTS (
        SELECT *
        FROM EMPLOYEE e3
        WHERE e3.ssn = e2.superssn
        AND e3.fname = 'James'
        AND e3.lname = 'Borg'
    )
);

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 13. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (single SELECT 사용)

In [41]:
%%sql

SELECT CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Employee_name
FROM EMPLOYEE e, EMPLOYEE supervisor, EMPLOYEE supersupervisor
WHERE e.superssn = supervisor.ssn
AND supervisor.superssn = supersupervisor.ssn
AND supersupervisor.fname = 'James'
AND supersupervisor.lname = 'Borg';

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 14. Retrieve the names of employees who make at least 10,000 dollars more than the employee who is paid the least in the company.

In [52]:
%%sql

SELECT CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Employee_name
FROM EMPLOYEE e
WHERE e.salary > (
    SELECT MIN(salary) + 10000
    FROM EMPLOYEE
);

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
4 rows affected.

[('Franklin T. Wong',),
 ('Ramesh K. Narayan',),
 ('James E. Borg',),
 ('Jennifer S. Wallace',)]

### 15-18번에 대해 SQL view문을 작성하고 MySQL에서 “select * from <view_name>”을 실행한 결과물을 제출하시오.

#### 15. A view that has the department name, manager name, and manager salary for every department

In [51]:
%%sql

CREATE VIEW DEPT_VIEW AS
SELECT d.dname AS Department_name,
       CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Manager_name,
       e.salary AS Manager_salary
FROM DEPARTMENT d, EMPLOYEE e
WHERE d.mgrssn = e.ssn;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
0 rows affected.

[]

In [53]:
%sql select * from DEPT_VIEW;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
3 rows affected.

[('Headquarters', 'James E. Borg', Decimal('55000.00')),
 ('Administration', 'Jennifer S. Wallace', Decimal('43000.00')),
 ('Research', 'Franklin T. Wong', Decimal('40000.00'))]

#### 16. A view that has the employee name, supervisor name, and employee salary for each employee who works in the ‘Research’ department

In [55]:
%%sql
CREATE VIEW RESEARCH_DEPT_VIEW AS
SELECT CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Employee_name,
       CONCAT(e.fname, " ",e.minit,". " ,e.lname) AS Supervisor_name,
       e.salary AS Employee_salary
FROM EMPLOYEE e, EMPLOYEE s, DEPARTMENT d
WHERE e.superssn = s.ssn
AND e.dno = d.dnumber
AND d.dname = 'Research';

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
0 rows affected.

[]

In [62]:
%sql select * from RESEARCH_DEPT_VIEW;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
4 rows affected.

[('John B. Smith', 'John B. Smith', Decimal('30000.00')),
 ('Franklin T. Wong', 'Franklin T. Wong', Decimal('40000.00')),
 ('Joyce A. English', 'Joyce A. English', Decimal('25000.00')),
 ('Ramesh K. Narayan', 'Ramesh K. Narayan', Decimal('38000.00'))]

#### 17. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project

In [63]:
%%sql
CREATE VIEW PROJECT_VIEW AS
SELECT p.pname AS Project_name,
       d.dname AS Controlling_dept_name,
       COUNT(w.essn) AS Number_of_employees,
       SUM(w.hours) AS Total_hours_per_week
FROM PROJECT p, DEPARTMENT d, WORKS_ON w
WHERE p.dnum = d.dnumber
AND p.pnumber = w.pno
GROUP BY p.pname, d.dname;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
0 rows affected.

[]

In [64]:
%sql select * from PROJECT_VIEW;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
6 rows affected.

[('ProductX', 'Research', 2, Decimal('52.5')),
 ('ProductY', 'Research', 3, Decimal('37.5')),
 ('ProductZ', 'Research', 2, Decimal('50.0')),
 ('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0'))]

#### 18. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project with more than two employees working on it

In [65]:
%%sql

CREATE VIEW PROJECT_VIEW_GT2 AS
SELECT p.pname AS Project_name,
       d.dname AS Department_name,
       COUNT(w.Essn) AS Number_of_employees,
       SUM(w.Hours) AS Total_hours_per_week
FROM PROJECT p, WORKS_ON w, DEPARTMENT d
WHERE p.pnumber = w.pno
AND p.dnum = d.dnumber
GROUP BY p.pname, d.dname
HAVING COUNT(w.essn) > 2;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
0 rows affected.

[]

In [66]:
%sql select * from PROJECT_VIEW_GT2;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
4 rows affected.

[('ProductY', 'Research', 3, Decimal('37.5')),
 ('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0'))]

#### 19. EMPLOYEE 테이블의 salary의 변경사항이 있을 때 마다, 변경사항을 기록하는 테이블 salary_audit(ssn, before_salary, after_salary, u_datetime)을 만들고, update trigger를 사용하여 변경사항을 기록하시오. 5번 부서에 속하는 직원의 salary를 100% 상향 조정 후, “select * from salary_audit”를 통해 결과를 확인하시오. udatetime에는 수정이 실행된 DATETIME(SQL Datatype, 날짜와 시각)을 기록한다. 현재 시각값은 now() 함수를 통해 얻을 수 있다.

## Warning
- 19번 문제 Update 한 후에 1-18번 문제를 다시 풀면 다른 결과가 나올 수 있음
- 1-18번 문제는 반드시 companydb의 초기 상태에서 풀어야 함

In [72]:
%%sql

create table salary_audit (
  ssn char(9),
  before_salary decimal(10,2),
  after_salary decimal(10,2),
  udatetime datetime
);

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
0 rows affected.

[]

In [78]:
%%sql

create trigger salary_audit_trig
after update
on EMPLOYEE
for each row
begin
if new.salary <> old.salary then
	insert into salary_audit values (new.ssn, old.salary, new.salary, now());
end if;
end

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
(MySQLdb.OperationalError) (1419, 'You do not have the SUPER privilege and binary logging is enabled (you *might* want to use the less safe log_bin_trust_function_creators variable)')
[SQL: create trigger salary_audit_trig
after update
on EMPLOYEE
for each row
begin
if new.salary <> old.salary then
	insert into salary_audit values (new.ssn, old.salary, new.salary, now());
end if;
end]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [75]:
%sql select * from salary_audit;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
0 rows affected.

[]

In [76]:
%sql update EMPLOYEE set salary = 2 * salary where dno = 5;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
4 rows affected.

[]

In [77]:
%sql select * from salary_audit;

 * mysql://s202000178:***@dm.hufs.ac.kr:3306/s202000178db
0 rows affected.

[]